Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: Hadean period.
ht: Peryòd hadean.

source: We don't have any kind of macroscopic-scale rocks from the Hadean period, and that's because at that time, we believe, the Earth was just this molten ball of kind of magma and lava, and it was molten because it was a product of all of these accretion events and all of these collisions and all this kinetic energy turning into heat.
ht: Nou pa gen nenpòt kalite macroscopiques échelle wòch nan règ Hadean a, e se pou sa paske Lè sa a, nou kwè l ', tè a te jis sa a en boul de jan de magma Et lave, Et sa li te genyen en paske li te gen yon pwodwi tout evènman accumulation sa yo Et, tout collisions sa yo ak tout sa a cinétique enèji vire nan chalè.

source: If you were to look at the surface of the Earth, if you were to be on the surface of the Earth during the Hadean eon, which you probably wouldn't want to be because you might get hit by a falling meteorite or probably burned by some magma, whatever, it would look like this, and you wouldn't be able to breathe anyway; this is what the surface of the Earth would look like.
ht: Si nou te gade sifas ki sou latè. Si nou te gen sou sifas tè a pandan eon Hadean la, ki ou pwobableman pa vle pou yo paske ou te ka jwenn fwape pa yon meteyorit ke tonbe ou kapab byen boule nèt ak kèk magma, que, li ta ka sanble tankou sila a, epi ou pa ka respire de tout fason, se sa sifas tè a ta ka sanble tankou.

source: It would look like a big magma pool, and that's why we don't have any rocks from there because the rocks were just constantly being recycled, being dissolved and churned inside of this giant molten ball, and frankly the Earth still is a giant molten ball, it's just we live on the super-thin, cooled crust of that molten ball.
ht: Li ta ka sanble yon pakèt gwo magma, Et se poutèt sa nou pa gen okenn wòch kote yo te paske wòch yo jis kèk en être recyclée, te ki te kraze Et churned andedan sa a gwo boul en, Et kare Tè a toujou se yon gwo boul en, li se jis nou viv sou super-Fine, par kwout de sa en boul.

source: If you go right below that crust, and we'll talk a little bit more about that in future videos, you will get magma, and if you go dig deeper, you'll have liquid iron.
ht: Si ou ale droit pi ba pase kwout sa, epi n a pale yon ti jan plis osijè de sa nan pwochen vidéos, ou pral resevwa magma, Et si ou fouye pi fon an, ou vle likid fèt an fè.

source: I mean, it still is a molten ball.
ht: Mwen vle di, li toujou se yon boul en.

source: And this whole period is just a violent, not only was Earth itself a volcanic, molten ball, it began to harden as you get into the late Hadean eon, but we also had stuff falling from the sky and constantly colliding with Earth, and really just continuing to add to the heat of this molten ball.
ht: Tout tan sa a, se jis yon vyolan, non sèlman te sou latè se yon vòlkan, en boul, la li te kòmanse fè di jan ou jwenn nan ta Hadean eon, Men, nou tou fè bagay ki tonbe soti nan syèl la Et en pyese avèk sou latè, Et se vwèman inikman kontinye pou ajoute pou chalè a boul en sa a.

source: Anyway, I'll leave you there, and, as you can imagine, at this point there was no, as far as we can tell, there was no life on Earth.
ht: De tout fason, m ap kite ou la a, Et, jan ou ka konprann, nan pwen sa te gen non, sa ke nou kapab di, te gen lavi pa gen sou latè.

source: Some people believe that maybe some life could've formed in the late Hadean eon, but for the most part this was just completely inhospitable for any life forming.
ht: Gen kèk moun kwè ke gen dwa viv kèk te kapab te fòme nan eon Hadean an reta, men pou pati ki plis, sa te jis complètement inhospitalières pou tout lavi qui.

source: I'll leave you there, and where we take up the next video, we'll talk a little bit about the Archean eon.
ht: M ap kite ou la, yo kote nou pote a videyo kap vini, n a pale yon ti jan sou eon Archean an.

source: We're in the British Museum, and we're looking at one of the most important objects in the collection - the Rosetta Stone.
ht: Nou gen nan mize Britanik la, e nou ap gade yonn nan les objets ki pi enpòtan nan koleksyon an- Wòch Rosetta la.

source: It's in a glass case, surrounded by people who are taking pictures of it.
ht: Se nan glas, te antoure pa pèp moun ki ap pran foto sa yo.

source: People love it!
ht: Moun ki renmen li!

source: They do.
ht: Yo te fè.

source: There [are] gifts in the gift shop about it.
ht: Il [sont] kado nan boutik kado sou sa.

source: You can get your own little Rosetta Stone.
ht: Ou ka jwenn kont ou ti wòch Rosetta.

source: You can get Rosetta Stone posters.
ht: Ou ka jwenn afich Rosetta wòch.

source: Exactly.
ht: Exactement.

source: On a mug.
ht: Sou yon godèt.

source: I think you can get a doormat Rosetta Stone.
ht: Mwen panse ke ou ka jwenn yon propreté wòch Rosetta la.

source: Yeah.
ht: Wi.

source: But, the stone itself is historically incredibly important.
ht: Men, wòch la, li menm ki istorikman palan te kon très enpòtan.

source: It allowed us for the first time to be able to understand, to be able to read, to be able to translate hieroglyphics.
ht: Li te pèmèt nou pou la pwemye fwa pou kapab konprann, gen dwa pou li, pou gen dwa pou tradwi hieroglyphics.

source: Hieroglyphics was the written language of the ancient Egyptians.
ht: Hieroglyphics li te genyen ekri lang de ansyen moun peyi Lejip yo.

source: And, until the mid-19th century, we really didn't know what it said.
ht: Et, jis nan mitan-19 syèk la, nou reyèlman pat konnen sa li te di.

source: The language itself is pictorial, and actually that led to one of the real confusions.
ht: Lang li menm pictural, e aktyèlman sa a pou youn nan vrè confusions yo.

source: Because, I think that early archaeologists believed - and linguists believed - that the pictures they could see - (You can make out birds and snakes, and various different kinds of forms.)
ht: Paske, mwen kwè ke sa byen bonè archéologues te kwè- Et akoz a-te pou foto yo kapab wè- (Ou kapab fè zwazo ak bann vèmen! ak plizyè kalite types diferan fòmilè.)

source: - actually referred in some way to a specific thing in the world.
ht: -aktyèlman te endike nan kèk fason pou yon bagay byen presi nan mond lan.

source: Right, so if you saw a bird, it somehow referred to a bird.
ht: Bò dwat, sa si nou te wè zwazo, li D' refere li yon zwazo.

source: And then, in fact, that's not the case. Right.
ht: Et puis, vre, se pa sa ka a. pa vre.

source: This is a far more sophisticated language.
ht: Sa se yon lang sofistike vinn yon bagay.

source: And the Rosetta Stone was really what helped them to understand that Egyptian hieroglyphics are not pictorial.
ht: Et la Rosetta wòch yo te vrèman ki te ede yo pou w konprann ke hieroglyphics moun peyi Lejip yo pa pictural.

source: They're not pictographs.
ht: Ke yo pa pictographs.

source: They're actually phonetic.
ht: Yo pa gen aktyèlman fonetik.

source: So, all those things that look like pictures actually represent sounds.
ht: Se konsa, tou sa ki sanble foto aktyèlman repwezante Sons.

source: And that's how they were able to finally figure out - and translate - ancient Egyptian hieroglyphics.
ht: E se pou sa ki jan yo te ka a la fen evalye- Et tradwi-ansyen hieroglyphics moun peyi Lejip.

source: And the reason we were able to do that is because this stone said the same statement three times, in three different languages.
ht: Konprann nou pa t ' kapab fè sa se paske wòch sa a te di nan deklarasyon menm twa fwa, nan twa diferan lang.

source: So, the three languages are:
ht: Se konsa, twa lang sont:

source: Ancient Greek, which is down at the bottom.
ht: Ansyen grèk, ki se desann nan fon.

source: Now, that was the language of the administration.
ht: Koulye a, ki te lang administrasyon an genyen.

source: That was the language of government.
ht: Sa li te genyen lang gouvènman an.

source: And the reason for that is because
ht: Rezon pou sa, se paske

source: Alexander the Great had conquered Egypt, and had set up this sort of Greek rule in this Hellenistic era - and that maintained itself in ancient Egypt.
ht: Alexander, grannèg te a peyi Lejip la, ak Grèk ki t' ap mache sou kalite lespri sa a te monte nan peryòd Époque- Et, ki toujou kenbe tèt li nan ansyen peyi Lejip la.

source: Let's remember, we're talking around 200 B.C. here. - which is actually getting close to the end of the life of hieroglyphics, as well.
ht: An n sonje, nap pale anviwon 200 B.C. isit la. -ki aktyèlman ap vin tou pre a fin de hieroglyphics, osi byen vivan.

source: It would last for another few hundred years before it died out completely.
ht: Li pwal dire pou yon lòt twa ane san anvan li te mouri nèt.

source: So, this is really the tail end of this 3000-year-long language.
ht: Se konsa, sa se vrèman ke a fini ki lang de long 3000 ane sa a.

source: So, the middle section is Demotic, which actually means "the language of the people."
ht: Se konsa, la mitan seksyon se Demotic, ki aktyèlman, "lang pèp la."

source: And it was this common language used by the Egyptians.
ht: Ak sa li te genyen sa a lang moun peyi Lejip yo fè kadejak.

source: And the top, of course, was the sacred writing.
ht: Et, sou tèt, men wi, li te ekri sakre.

source: This was hieroglyphs. Right.
ht: Sa te caractères. pa vre.

source: And that was the language that we really couldn't read -
ht: Ak sa li te genyen lang sa nou vrèman pas lire-

source: - until we had the Rosetta Stone.
ht: -jiskaske nou te gen wòch Rosetta la.

source: And we could see within the writing of the Rosetta Stone, cartouches, which held the names of the rulers.
ht: E nou te kapab wè nan ekri wòch Rosetta la, cartouches, ki te kenbe non chèf.

source: Cartouches are a kind of oblong shape that contains the name of the ruler.
ht: Cartouches se yon jan de oblong fòm ki gen non moun ki gen pouvwa.

source: In this case, that would be Ptolemy the Fifth.
ht: Nan ka sa, sa ta kapab Ptolémée, senkyèm lan.

source: And by recognizing that ruler's name, in these three different languages, we found a way to begin to unlock hieroglyphics.
ht: E pa reconnaissant non chèf sa, nan lang lòt twa sa yo, nou te jwenn yon fason pou te chita nan pou déverrouiller hieroglyphics.

source: Now, that would take decades.
ht: Koulye a, sa ta pran dè dekad.

source: It was an incredibly difficult task.
ht: Se te yon tâche très difisil.

source: And we haven't even talked yet about how this was found!
ht: Et te nou poko menm pale encore osijè de kòman sa a yo te jwenn.

source: Napoleon has his army in Egypt.
ht: Napoleon gen sòlda li nan peyi Lejip la.

source: And Napoleon's brought with him some - what I guess we would call, sort of - archaeologist types.
ht: Et Napoleon la a avè l' ti gout- Kisa mwen panse nou ta ka rele, asye de-kalite archéologue yo.

source: And, one of those people who accompanied Napoleon found - or came across - the Rosetta Stone.
ht: Et, yonn nan moun ki te akonpaye Napoleon -li te jwenn ou vin kontre-wòch Rosetta la.

source: It was being used as a part of the foundation of a fort, in fact.
ht: Li te itilize tankou yon pati nan yon de fondasyon de yon fò, nan fait.

source: And of course, it would originally have been erected in a temple, or near an ancient Egyptian temple.
ht: Et de men wi, li ta initialement ont te érigée nan yon tanp, oubyen tou pre yon tanp ansyen moun peyi Lejip.

source: And, I suppose it's important to say that this is the bottom portion of a much larger stele - or sort of stone tablet - that would have been quite tall.
ht: E mwen kwè li enpòtan pou di sa sa se pati bounda bough @ branch de yon kantite plus stèle- ou kalite grenn wòch-ki ta ont été très haut.

source: So, Napoleon took it back.
ht: Se konsa, Napoleon pote l' vin.

source: Except, hold on a second - because we're not in the Louvre.
ht: Sauf, kenbe yon dezyèm- paske nou pa santi w nan Louvre a.

source: We're in London, in the British Museum.
ht: Nou ap nan London, nan mize Britanik lan.

source: So, how does that work?
ht: Se konsa, ki fè sa ki travay?

source: Well, the British defeated Napoleon, and brought back the stone.
ht: Men, ke se Bwitich ki te defèt Napoleon, Et a tounen wòch la.

source: And a year or two later - I think, 1801 or 1802 - it's brought to the British Museum.
ht: Ak yon ane ou de pita-m panse, 1801 ou 1802- li te pote pou mize Britanik lan.

source: And it's been here ever since.
ht: E li te isit la tout tan tout tan depi.

source: Well, it's clearly still extremely popular.
ht: Men, toujou clairement extrêmement popilè.

source: I've got a matrix A, and it's an m by n matrix.
ht: Mwen genyen yon matrice UN, Et se yon m pa n matrice.

source: It has m rows and n columns.
ht: Li gen èskonbwit m Et n colonnes.

source: So I can write it in fairly general terms like this.
ht: Se konsa, mwen ka ekri li an tèm assez jeneral kon sa.

source: The first row would be a11.
ht: Premye dispit lan ta a11.

source: First row, first column. a12, First row, second column.
ht: Premye ligne, premye kolòn. a12, premye ligne, dezyèm kolòn.

source: All the way to-- I have n columns.
ht: Jouk yo rive pou - m n colonnes.

source: So a1n, first row, n-th column.
ht: Se konsa a1n, premye ligne, n klas 11yèm kolòn.

source: And then the second row would look like this. a second row, first column.
ht: Et puis dispit dezyèm lan ta ka sanble tankou sila a. yon dezyèm ligne, premye kolòn.

source: A second row, second column.
ht: Yon dezyèm ligne, dezyèm kolòn.

source: All the way to a second row, n column.
ht: Jouk yo rive pou yon dezyèm ligne, kolòn n.

source: And we'll just keep doing that all the way down until you get to the m-th row.
ht: Nou ap jis toujou fè sa jouk yo rive sou jiskaske ou jwenn pou klas 11yèm m ligne.

source: The m row would look like this.
ht: La ligne nan m ta ka sanble tankou sila a.

source: Each of these are the entries in each of the rows or columns, depending on how you want to look at it.
ht: Chak nan yo sont entrées yo nan chak nan yo èskonbwit ou colonnes, selon jan ou vle gade sou li.

source: So this is going to be a sub m 1. mth row, first column. a sub m 2.
ht: Se konsa sa a pwal gen yon m sub 1. mth ligne, premye kolòn. yon sub m 2.

source: And you go all the way to a sub m n.
ht: Et ou ale jouk yo rive pou sub m n.

source: This is our matrix right here.
ht: Sa se matrice nou isit.

source: That is my matrix A.
ht: Se sa rele m' matrice A.

source: Now, I'm going to define the transpose of this matrix as A with this superscript T.
ht: Koulye a, mwen pral defini transpose de matrice sa a kòm yon ak sa a / g.

source: And this is going to be my definition, it is essentially the matrix A with all the rows and the columns swapped.
ht: Apre sa, sa ap fè m' definisyon, se esansyèlman matrice UN ak tout èskonbwit yo Et les colonnes remplacez.

source: So my matrix A transpose is going to be a n by m matrix.
ht: Se konsa m' matrice, UN transpose pwal yon n pa matrice m.

source: Notice I said m rows and n columns.
ht: Santi m te di m èskonbwit Et colonnes n.

source: Now this is going to have n rows and m columns.
ht: Koulye a sa a pwal dwe vizite èskonbwit Et colonnes m.

source: So what is this guy going to look like?
ht: Se poutèt sa nèg sa a pwal sanble?

source: What is he going to look like?
ht: Sa li pwal sanble?

source: Well I'm gonna swap my rows and my columns.
ht: Men m ap twoke èskonbwit m' Et colonnes m.

source: So my first row becomes my first column.
ht: Se konsa m' premye ligne est m' premye kolòn.

source: So I'm going to have a11.
ht: Se konsa, mwen pral gen a11.

source: That entry's still going to be in that position.
ht: Antre sa a pwal toujou nan pozisyon sa.

source: But now this entry is not going to be right here. a12.
ht: Men, koulye a, sa a pa pwal droit isit la. a12.

source: And my second row I have what I used to have in my second row, first column.
ht: Et ligne dezyèm m' mwen gen sa mwen te konn gen nan mwen, yon lòt ligne, premye kolòn.

source: I'm now going to have what I had in my second column, first row.
ht: Mwen kounye a pwal fè sa mwen te nan dezyèm m Kolòn, premye ligne.

source: I'm just going to go down all the way to a1n.
ht: Mwen jis ap desann nan tout wout pou a1n.

source: And that makes-- not a i n, a1n.
ht: Et sa fè-m yon n, a1n.

source: And that makes sense because I'll now have n columns.
ht: Et, sa fè sans, paske sa m' ap koulye a ap vizite colonnes.

source: Sorry I now have n rows.
ht: M regrèt mwen kounye a gen èskonbwit n.

source: I had n columns before.
ht: M te fè n colonnes devan.

source: Now I have n rows.
ht: Koulye a, mwen gen èskonbwit n.

source: Now this row, when I transpose it is going look like this. a21, a22, all the way down to a2n.
ht: Kounye a ligne sa a, lè mwen ap transpose l' pwal sanble tankou sila a. a21, a22, jouk yo rive sou a2n.

source: It might be a little confusing for you right now to have this notation right there because everything we've done so far.
ht: Ta ka jwenn yon ti kras Confusion pou nou kounye a gen pou m ' notasyon dwa gen paske tou sa nou te fè twò lwen.

source: We've always said, hey this first number's the row and the second number is the column.
ht: Nou toujou te di: alo sa a premye nimewo a la ligne Et la dezyèm nombre se kolòn a.

source: That's what we did up here.
ht: Sa se sa nou te fè moute isit la.

source: What I'm doing here, you can ignore that reference to the rows and columns.
ht: Sa m' pral fè la a, ou ka vag referans sa a èskonbwit Et colonnes.

source: You can just say whatever we had here in my first row, second column, I now have here.
ht: Ou senpleman kapab ' di tou sa nou te genyen isit la nan premye ligne m, Kolòn dezyèm, koulye a mwen isit la.

source: When you look at this transpose, don't take these subscripts too literally.
ht: Lè ou gade nan transpose sa a, pa pran sa indices twò littéralement.

source: Or now you can kind of reverse your interpretation.
ht: Ou koulye a ou ka ti jan opoze entèpretasyon ou.

source: This is now the first column, second row.
ht: Sa se koulye a premye rèl do, dezyèm ligne.

source: This was the second row, first column.
ht: Sa te dezyèm ligne, premye kolòn.

source: I don't want you get too confused with these subscripts.
ht: Mwen pat vle ou fè twò confondre ak tout bagay sa indices.

source: Just keep in mind, we're taking all the rows and turning them into the columns to get the transpose.
ht: Jis pa bliye, n ap pran tout èskonbwit yo Et lide yo te antre nan les colonnes pou jwenn transpose a.

source: And then you just keep doing this.
ht: Apre sa, lè sa a nou jis ap toujou fè sa.

source: And then this m-th row will now become the m-th column. am1, am2, all the way down to a m n.
ht: Tou lè sa ligne m klas 11yèm sa a va koulye a kolòn m klas 11yèm a. am1, am2, jouk yo rive sou yon n m.

source: So, this entry is now that entry.
ht: Se konsa, sa a se koulye a sa antre.

source: If you know, this entry is now that entry.
ht: Si nou konnen, sa a se koulye a sa antre.

source: That entry is now at that entry.
ht: Antre sa se koulye a sa antre nan.

source: This is what A transpose is.
ht: Sa a se nan yon transpose.

source: And sometimes when you do in the abstract, it can be a little confusing.
ht: Pafwa lè n' ap fè nan résumé a, sa ka sèvi yon ti kras ki pa klè.

source: And we'll especially appreciate that once we do some of the proofs involving the transpose.
ht: E nou pwal èspesyalman apresye sa yon fwa ke, nou fè kèk nan prèv yo impliquant transpose a.

source: But actually taking the transpose of an actual matrix, with actual numbers, shouldn't be too difficult.
ht: Men yo aktyèlman ap pran transpose de yon matrice réelle, ak anpil réelle, devrait être twò difisil.

source: So, let's start with the 2 by 2 case.
ht: Se konsa, an nou konmanse ak 2 2 pa ka a.

source: I'll try to color code it as best as I can.
ht: M pral seye koulè code comme bon jan mwen kapab.

source: So let's say I have the matrix.
ht: Se konsa nou di m' la matrice.

source: Let's say I defined A.
ht: An n di m jan l defini A.

source: Let's do B now.
ht: An n fè B koulye a.

source: I already defined A.
ht: Mwen te defini deja A.

source: Let's say B.
ht: An n ap di b

source: B is equal to the matrix 1, 2, 3, 4.
ht: B egal a la matrice 1, 2, 3, 4.

source: Those colors are pretty close.
ht: Koulè sa sont très étroite.

source: But what is B transpose going to look like?
ht: Men sa B transpose pwal sanble?

source: B transpose is going to be equal to-- You switch the rows and columns.
ht: B transpose pwal egal - ou chanje èskonbwit yo Et colonnes.

source: So the first row will now become the first column.
ht: Se poutèt sa, premye dispit lan koulye a ap tounen kolòn premye a.

source: And the second row will now become the second column, 3, 4.
ht: La ligne dezyèm koulye a ap tounen a dezyèm kolòn, 3, 4.

source: Or you could view it the other way.
ht: Ou, ou te kapab wè li lòt bò a.

source: The first column now became the first row.
ht: Kolòn premye a ki kounye a te pwemye dispit lan.

source: And the second column now became the second row.
ht: Dezyèm kolòn a ki kounye a moute dispit dezyèm lan.

source: Let's do an example.
ht: An n fè yon egzanp.

source: Instead of even doing a 2 by 3-- or a 3 by 3-- let me do one that might be a little bit more challenging.
ht: Olye ke yo menm ap fè yon 2 pa 3 - ou yon 3 pa 3 - pou m' fè yonn ki kapab yon ti jan plis difficile.

source: I think this'll make things clear.
ht: Mwen kwè ke sa a ap fè bagay ki klè.

source: So let's say I have the matrix C.
ht: Se konsa nou di m' la matrice c

source: Let me make it a pretty big matrix.
ht: Pou m' fè l' yon bèl gwo matrice.

source: Let's say it is a 4 by 3 matrix right here.
ht: An n pale se yon 4 pa 3 matrice droit isit la.

source: Let me just throw some numbers in there.
ht: Kite m' jis voye kèk moun ladan.

source: 1, 0, minus 1.
ht: 1, 0, 1 moins.

source: Oh I want to do it in different colors.
ht: O mwen vle pou ou fè l nan plizyè koulè.

source: Let me do that in a different color.
ht: Pou m' fè sa nan yon koulè diferan.

source: So then I get 2, 7, minus 5.
ht: Se konsa lè sa a, mwen pran 2, 7, moins 5.

source: Then I get 4 minus 3, 2.
ht: Lè sa a, mwen pran 4 moins 3, 2.

source: I have to do one more row here.
ht: Mwen gen pou yo fè yon sèl plis ligne isit la.

source: So let me just make that minus 1, 3, and 0.
ht: Se pou m' sèlman fè sa moins 1, 3 Et 0.

source: That is my matrix C.
ht: Se sa rele m' matrice c

source: So what is-- let me do that, and I like to be aesthetically pleasing.
ht: Se poutèt sa se - kite m' fè sa, Et mwen renmen pou : plezi.

source: So let me close the bracket in the same color.
ht: Se pou m' fèmen Support a nan menm koulè a.

source: So what is C transpose going to be?
ht: Se poutèt sa C transpose pwal?

source: So, C transpose.
ht: Se konsa, C transpose.

source: C transpose is now going to be a 3 by 4 matrix.
ht: C transpose koulye a pwal gen yon matrice 3 pa 4.

source: And, essentially, it's going to be the matrix C with all the rows swapped for the columns or all the columns swapped for the rows.
ht: Et esansyèlman, li pwal être matrice C ansanm ak tou sa èskonbwit ki remplacez pou les colonnes ou tout colonnes yo remplacez pou èskonbwit yo.

source: So, it's now going to be a 3 by 4 matrix.
ht: Se konsa, li koulye a ap gen yon matrice 3 pa 4.

source: And that first row there is now going to become the first column.
ht: Et sa premye ligne la kounye a pwal pou yon kolòn premye a.

source: The second row here is now going to become the second column.
ht: An dezyèm ligne isit la kounye a pwal pou yon kolòn dezyèm lan.

source: 2, 7, minus 5.
ht: 2, 7, moins 5.

source: I didn't use the exact same green, but you get the idea.
ht: Mwen pa sèvi ak menm vèt egzat a, men, ou fè lide a.

source: This third row will become the third column.
ht: Ligne twazyèm sa a ap tounen twazyèm kolòn a.

source: 4, minus 3, 2.
ht: 4, moins 3, 2.
